import React from 'react';
import './Blog.css'
const Blog = () => {
    return (
        <div>
            <div>
                <h1>what is Context Api ?</h1>
            </div>
            <div className='context-ans'>
                <h3>Ans.</h3>
                <p>রিঅ্যাক্ট কনটেক্সট এপিআই হল একটি রিঅ্যাক্ট অ্যাপের জন্য কার্যকরভাবে গ্লোবাল ভেরিয়েবল তৈরি করার একটি উপায় যা চারপাশে পাস করা যেতে পারে। এটি "প্রপ ড্রিলিং" বা দাদা-দাদি থেকে শিশু থেকে পিতা-মাতার কাছে প্রপস সরানোর বিকল্প। রেডক্স ব্যবহার করে রাজ্য পরিচালনার জন্য প্রসঙ্গটিকে একটি সহজ, হালকা পদ্ধতি হিসাবেও উল্লেখ করা হয়।

                    কনটেক্সট এপিআই হল রিঅ্যাক্টের 16.3 সংস্করণে যোগ করা একটি (ধরনের) নতুন বৈশিষ্ট্য যা একজনকে পুরো অ্যাপ জুড়ে (বা এটির অংশ) হালকাভাবে এবং স্বাচ্ছন্দ্যে স্থিতি ভাগ করতে দেয়।,</p>
            </div>

            <div>
                <h1>what is Semantic tag ?</h1>
            </div>
            <div className='context-ans'>
                <h3>Ans.</h3>
                <p>শব্দার্থিক এইচটিএমএল ট্যাগগুলি সেই ট্যাগের বিষয়বস্তু সম্পর্কে তথ্য প্রদান করে যা একটি পৃষ্ঠায় তারা যেভাবে দেখায় তার বাইরে যায়৷
                    <br /> ট্যাগে আবদ্ধ পাঠ্যটি অবিলম্বে ব্রাউজার দ্বারা কিছু ধরণের কোডিং ভাষা হিসাবে স্বীকৃত হয়। সেই কোডটি রেন্ডার করার চেষ্টা করার পরিবর্তে,
                    <br />
                    ব্রাউজার বুঝতে পারে যে আপনি একটি নিবন্ধ বা অনলাইন টিউটোরিয়ালের উদ্দেশ্যে কোডের উদাহরণ হিসাবে সেই পাঠ্যটি ব্যবহার করছেন৷

                    শব্দার্থিক ট্যাগগুলি ব্যবহার করা আপনাকে আপনার সামগ্রীকে স্টাইল করার জন্য আরও অনেক হুক দেয়।
                    <br /> সম্ভবত আজ আপনি আপনার কোড নমুনাগুলি ডিফল্ট ব্রাউজার শৈলীতে প্রদর্শন করতে পছন্দ করেন, কিন্তু আগামীকাল,
                    আপনি একটি ধূসর পটভূমির রঙ দিয়ে তাদের কল করতে চাইতে পারেন; পরে এখনও,
                    <br />   আপনি আপনার নমুনার জন্য ব্যবহার করার জন্য সুনির্দিষ্ট মনো-স্পেসড ফন্ট ফ্যামিলি বা ফন্ট স্ট্যাক নির্ধারণ করতে চাইতে পারেন।
                    <br /> আপনি শব্দার্থিক মার্কআপ এবং স্মার্টভাবে প্রয়োগ করা CSS ব্যবহার করে এই সমস্ত জিনিসগুলি
                    সহজেই করতে পারেন।
                </p>
            </div>
        </div>
    );
};

export default Blog;